"""
    @Author:Irene
    @Time:2026/5/13
    @Desc:
 """
import math

"""
    1、在python中赋值运算符有3种形式：
    （1）=
    （2） +=, -= 等
    （3） := 
    
    2、=
    =的左边一定是一个变量/常量
    把=右边的值赋值给左边的变量或常量
    赋值运算符的优先级最低
"""
# a = 1 #把一个字面量赋值给a
# print(a)
# # 1 = a #错误
# a = math.sqrt(9) #把sqrt函数计算的结果赋值给a
# print(a)
# b = 6
# a = a * b # 把表达式计算的结果赋值给a
# print(a)

"""
    3、+=, -=， *=, /=, //=, **= 等
"""
# a = 1
# print(a)
# a += 3  # a = a + 3
# print(a)
# a *= 6 # a = a * 6
# print(a)
# a *= a + 3 # a = a * (a+3)
# print(a)
# #a是同一个变量，上面的计算结果对下面是有影响的

"""
    4、:=  海象运算符，在表达式中同时进行赋值和返回赋值的值进行下一步操作。Python3.8 版本新增（了解）
"""
a = 3
print("a=",a, "a+1>4：", a+1>4)
print("a=",a, "a+1>4：", (a:=a+1)>4) #a变量的值+1，即修改a变量的值，同时又要用新的值与4比较
print("a=",a)

# print("a=",a)
# a = a+1
# print("a+1>4：", a+1>4)
# print("a=",a)