"""
    @Author:Irene
    @Time:2026/5/13
    @Desc:
 """
"""
    1、进制：
    （1）十进制，数字范围[0,9]，进位规则：逢十进一
        在程序中，正常表示数字即可
    （2）二进制，数字范围[0,1]，进位规则：逢二进一
        在程序中，在数字前面0B 或 0b
    （3）八进制，数字范围[0,7]，进位规则：逢八进一
        在程序中，在数字前面0o 或  0O(大写o）
    （4）十六进制，数字范围[0,9][A,F]，进位规则：逢十六进一
        在程序中，在数字前面0X 或 0x
    十进制   二进制
    0       0
    1       1
    2       10
    3       11
    4       100
    。。。
"""
#数字： 101010
print("十进制101010：", 101010)
print("二进制101010：", 0B101010)
print("八进制101010：", 0o101010)
print("十六进制101010：", 0X101010)
"""
显示结果：都是十进制结果
十进制101010： 101010
二进制101010： 42
八进制101010： 33288
十六进制101010： 1052688
"""

#数字：856
print("十进制856：", 856)
# print("二进制856：", 0B856)#错误
# print("八进制856：", 0o856)#错误
print("十六进制856：", 0X856)

"""
    2、各种进制如何换算
    人工算（了解）
    （1）十进制->二进制
        除2倒取余
    （2）二进制 -> 十进制
        权值相加法，从右往左依次是2的0次，1次，...
    （3）十进制 -> 八进制
        除8倒取余
    （4）八进制 -> 十进制
        权值相加法，从右往左依次是8的0次，1次，...
    。。。。
    
    计算器（能使用）
"""
num = 25
print("十进制：",num)
print("二进制：",bin(num))
print("八进制：",oct(num))
print("十六进制：",hex(num))
"""
显示结果：
十进制： 25
二进制： 0b11001
八进制： 0o31
十六进制： 0x19
"""

s = "11001"
print("十进制：", int(s))
print("二进制：", int(s,2)) #11001看成二进制数字
print("八进制：", int(s,8)) #11001看成八进制数字
print("十六进制：", int(s,16)) #11001看成十六进制数字
"""
显示结果：
十进制： 11001
二进制： 25
八进制： 4609
十六进制： 69633
"""