"""
    @Author:Irene
    @Time:2026/5/13
    @Desc:
 """
"""
    1、位运算符有哪些？（缺点：难，不直观，优点：计算效率非常高）（要求：理解）
    左移：<<
    右移：>>
    按位与：&
    按位或：|
    按位异或：^
    按位取反：~
    
    2、所有计算都是基于补码。
"""
#左移：<<
print(5 << 3)
"""
    原理分析：
    5的补码：0000 0101
    5<<3：  0 0101 000 （补码）
        计算器看结果：0 0101 000放到计算器中
        人工看结果：权值相加 
    快速口诀：左移几位，相当于乘以2的几次方
        5 << 3相当于 5乘以 2的3次 = 5*8=40
"""

#右移：>>
print(40 >> 3)
"""
    原理分析：
    40的补码：0010 1000
    40>>3：  000 0010 1
    
    快速口诀：右移几位，相当于除以2的几次方
        40 >> 3 相当于 40 除以 2的3次 = 40 // 8
"""

print(41 >> 3)
"""
    原理分析：
    41的补码：0010 1001
    41>>3：  000 0010 1

    快速口诀：右移几位，相当于除以2的几次方
        41 >> 3 相当于 41 除以 2的3次 = 41 // 8
"""

print(-41 >> 3)
"""
    原理分析：
    -41的补码：11010111
    -41>>3：  11111010

    快速口诀：右移几位，相当于除以2的几次方
        -41 >> 3 相当于 -41 除以 2的3次 = -41 // 8 = -6
"""

# print(-41 >>> 3)#错误，python中没有无符号右移

"""
    按位与：&
        1 & 1 才为1，其余为0
    按位或：|
        0 | 0 才为0，其余为1
    按位异或：^
        不同为1，相同为0
        先是把两个操作数的二进制位对齐，然后计算。

"""
print(41 & 3) #1
print(41 | 3) #43
print(41 ^ 3) #42
"""
原理分析：
    41的补码：0010 1001
    3的补码： 0000 0011
&----------------------
             0000 0001 
               
    41的补码：0010 1001
    3的补码： 0000 0011
|----------------------
             0010 1011
             
    41的补码：0010 1001
    3的补码： 0000 0011
^----------------------  
             0010 1010          
"""

"""
    按位取反：~
        它是一元运算符。对操作数所有二进制位取反，包括符号位。
"""
print(~41) #-42
"""
原理分析：
    41的补码：0010 1001
    ~41：    1101 0110
"""