"""
    @Author:Irene
    @Time:2026/5/19
    @Desc:
"""
"""
    1、什么是递归？
    递归是指一个函数直接的或间接的出现自己调用自己的情况，称为递归调用。简单说：自己调用自己。
    
    2、递归调用的常见问题
    当一个递归调用没有条件限制，或者有条件，但是递归的层数太多，都会导致栈内存溢出的问题。
    
    3、关于函数调用的2个动作：
    （1）入栈：当函数被调用时，python解释器会在栈内存空间给这个函数开辟一整块独立的内存空间，用于存储这个函数的局部变量、操作数栈等信息。
    （2）出栈：当函数调用结束时，python解释器会自动释放该函数占用的栈内存空间。
    而递归调用是含着嵌套调用。
    
    4、递归的正确使用
    （1）必须是有条件的递归，即有终结的条件
    （2）深度不宜太深
"""
# def func():
#     print("func开始被调用了")
#     func()
#     print("func调用结束了")
#
# func()

"""
    需求：求n!
    分析：
        假设 f(n)代表n!
        当n=1,  f(1) = 1
        当n=2,  f(2) = 2 * f(1)
        ...
                f(n) = n * f(n-1)
"""
# def f(n):
#     if n < 0:
#         return 0
#     if n == 1 or n == 0:
#         return 1
#     return n * f(n - 1)
# print(f(5))

"""
    需求：有一个斐波那契数列，从第三个数开始，每一个数等于前2个数之和。
    例如：1,1,2,3,5,8,13，。。。。
    现在要求斐波那契数列中第n个数是多少
    
    分析：
        假设 f(n)代表 斐波那契数列中第n个数
        已知条件， n=1 or n=2  f(1) 或 f(2) = 1
                 f(3) = f(1) + f(2)
                 ...
                 f(n) = f(n-2) + f(n-1)
"""
def f(n):
    if n<1:
        return 0
    if n == 1 or n == 2:
        return 1
    return f(n-2) + f(n-1)

# for i in range(1, 10):
#     print(f(i))

print(f(5))