"""
    @Author:Irene
    @Time:2026/5/19
    @Desc:
"""
"""
    如果走台阶，一次只能跨1步或2步，台阶数量共10级，请问共有多少种走法。
    分析：
        假设 f(n)代表n级台阶的总走法
        已知：
1                                               f(1) = 1       
11   2                                          f(2) = 2
111   21  12                                    f(3) = 3 = f(2) + f(1)
1111 211  121   112  22                         f(4) = 5 = f(3) + f(2)
11111 2111  1211   1121  221  1112   212  122   f(5) = f(4) + f(3)
"""
# def f(n):
#     if n<1:
#         return 0
#     if n==1 or n==2:
#         return n
#     return f(n-1) + f(n-2)
#     #f(n-1)代表最后一步跨一级台阶
#     #f(n-2)代表最后一步跨二级台阶
#
# print(f(10))


""""
一个猴子第一天摘了n个桃子，从第一天开始，每天吃剩余桃子数量的一半+1个桃子，
第10天只有1个桃子了，问第一天摘了多少桃子。

分析：
    假设 f(n)代表第n天桃子的数量
        f(10) = 1
        f(9) ÷ 2 -1 = f(10)  =>  f(9) = (f(10) + 1) * 2
        ...
        f(n) = (f(n+1) + 1) * 2
"""
# def f(n):
#     if n<1 or n>10:
#         return 0
#     if n==10:
#         return 1
#     return (f(n+1) + 1) * 2
#
# for day in range(1, 11):
#     print(f"第{day}天桃子的数量{f(day)}")

"""
用递归实现不死神兔：故事得从西元1202年说起，话说有一位意大利青年，名叫斐波那契。
在他的一部著作中提出了一个有趣的问题：假设一对刚出生的小兔一个月后就能长成大兔，
再过一个月就能生下一对小兔，并且此后每个月都生一对小兔，没有发生死亡，
问：现有一对刚出生的兔子2年后(24个月)会有多少对兔子?

分析： f(n)代表第n天兔子的对数
             小兔                             大兔
      f(1) = 1                +                 0
      f(2) = 0                +                 1 
      f(3) = 1(看成f(1)的所有兔子生下的小兔)  +      1(它就是前一个月所有兔子的数量)
      f(4) = 1(看成f(2)的所有兔子生下的小兔)  +      2 
      f(5) = 2(看成f(3)的所有兔子生下的小兔)  +      3 
      ...
      
      f(1) = 1
      f(2) = 1
      f(3) = f(1) + f(2)
      f(4) = f(2) + f(3)
      ...
      f(n) = f(n-2) + f(n-1)

"""
def f(n):
    if n<1:
        return 0
    if n==1 or n==2:
        return 1
    return f(n-2) + f(n-1)

print(f(10))



