"""
    @Author:Irene
    @Time:2026/5/18
    @Desc:
"""
"""
    1、什么是函数？
    函数(function)：它是代表一段独立的可复用的功能。在Java等其他语言中（面向对象的编程语言）一般称为方法（method）。
    在python中既有面向对象的编程语言的风格，又有像C语言面向过程的编程语言的风格。
    例如：print()函数， max()函数等
    
    2、函数有一个原则：必须先定义(define)后使用/调用(invoke)，不调用不执行，调用一次执行一次。
"""
# #定义函数
# def say_hello():
#     print("hello")
#
# #调用函数，使用函数
# say_hello()
# say_hello()
# say_hello()

"""
    3、如何定义一个函数？
    语法格式：
    def 函数名(): #无参的函数，定义时不能省略()
        函数体语句
    def 函数名(形参列表): #有参的函数
        函数体语句
    
    在python中，一切皆对象，一个函数也是一个对象。如果只是打印，或使用函数名，没有加()，就表示打印或使用是一个函数对象，此时不是用函数的功能。
    
    调用格式：
    函数名()
    函数名(实参列表)
    
    3、形参列表和实参列表
    （1）形参列表：形式参数列表，它在【定义】函数时，起到占位符的作用。函数调用之前，形参是没有具体值的。
    （2）实参列表：实际参数列表，它在【调用】函数时，起到给形参传值的作用，赋值的作用。有的实参，形参就有具体值了。
    def add(a,b): #(a,b)是形参列表，调用之前，a,b没有具体值，不知道什么值
        return a+b
    print(add(1,2))  #(1,2)是实参列表，调用时，1赋值给a,2赋值给b。
"""
# def say_hi(): #无参函数
#     print("hi")
#
#
# # print(say_hi) #<function say_hi at 0x000002154A08A2A0> 这里表示打印的是say_hi的函数对象
# m = say_hi #把一个函数对象赋值给m，m就等价于say_hi函数
# say_hi() #调用say_hi()函数
# m() #调用m函数，本质上就是调用say_hi函数

def add(a,b): #有参函数
    return a+b #return代表返回a+b的计算结果，并且结束add函数的执行
print(add) #打印函数对象 <function add at 0x0000028BCE25A2A0>
print(add(1,2)) # add(1,2)调用函数，执行函数的功能
add(4,5) #也是调用add函数，add(4,5)执行了函数功能，但是因为这里没有接收，没有打印返回的结果，所以结果丢失了