"""
    @Author:Irene
    @Time:2026/5/18
    @Desc:
"""
"""
    1、什么是函数的嵌套调用？
    在函数a中又调用了函数b，甚至在函数b中还调用了函数c，....
    
    2、关于函数调用的2个动作：
    （1）入栈：当函数被调用时，python解释器会在栈内存空间给这个函数开辟一整块独立的内存空间，用于存储这个函数的局部变量、操作数栈等信息。
    （2）出栈：当函数调用结束时，python解释器会自动释放该函数占用的栈内存空间。
    
    可以把栈结构看成一个桶或箱子，栈分为栈底和栈顶。
    先入栈的在栈底，后入栈的在栈顶。
    栈的特点：先进后出（FILO：First In Last Out） 或 后进先出（LIFO：Last In First Out）
"""
def a():
    print("a函数开始执行...")
    b()
    print("a函数调用结束")

def b():
    print("b函数开始执行...")
    c()
    print("b函数调用结束")

def c():
    print("c函数开始执行...")
    print("c函数调用结束")

#调用a函数
a()
"""
运行结果：
    a函数开始执行...
    b函数开始执行...
    c函数开始执行...
    c函数调用结束
    b函数调用结束
    a函数调用结束
"""