"""
    @Author:Irene
    @Time:2026/5/12
    @Desc:
 """
"""
    1、什么是变量？
    早上安装软件时，提到环境变量path,刚才讲关键字、注释时也提到了变量。
    变量：用一个标识符(单词，单词组）来表示一个数据。
    例如：age = 18，name = "柴林燕"
    这里的age,name就是变量。
    path=D:/ProgramFiles/Python/Python312，这里的path也是变量，代表python的安装路径。 
    便于在程序中使用这些数据。
    
    2、在python程序中的变量的值保存在内存中
    本质上内存的访问是通过内存地址，例如：140734751501272，但是内存地址对于程序员查看代码来说是不友好的，
    为了便于访问内存中的数据，给这块内存取一个变量名。
    
    3、变量本身是没有数据类型的，但是变量中的数据是有类型的
    18是int整数类型
    "柴林燕"是str字符串类型
    3.14是float浮点类型
    ....
    
    4、在python中同一个变量，可以赋予不同类型的数据值
    整数类型，小数类型正常表示，
    字符串类型，使用单引号，双引号表示，可以是单行文本，可以是多行文本（多行文本就是3个双引号，3个单引号）
    布尔类型，只有2个值 True，False
    
    如何查看变量中数据的类型，通过type(变量)
    
    5、python中的变量不用声明，直接使用。但是第一次使用变量之前，必须初始化。
    打印变量的值也是使用变量，用变量计算也是使用变量。
    
"""
age = 18 # 第一次给age赋值称为初始化
print("我今年的年龄是",age)
#表达我明年的年龄
age = age + 1 # 再次赋值，修改变量的值
print("我明年的年龄是",age)
print(type(age))

age = "年龄" # 再次赋值，修改变量的值
print(age)

age = True # 再次赋值，修改变量的值
print(type(age))
