"""
    @Author:Irene
    @Time:2026/5/12
    @Desc:
 """
"""
    算术运算符：
    （1）+
    正号：一元运算符
    加法：数值类型，二元运算符
    拼接：字符串类型，二元运算符
    
    一元运算符（只有1个操作数）和二元运算符（需要2个操作数）
    一元运算符又称为单目运算符
    二元运算符又称为双目运算符
    
    （2）-
    负号：一元运算符
    减法：数值类型，二元运算符
    
    （3）*
    乘法：数值类型，二元运算符
    
    （4）/
    除法 ：数值类型，二元运算符
    
    （5）整除 //（向下取整）
    
    （6）取模 %
    
    被除数 ÷ 除数 = 商 ... 余数
                整除的商
                
    被除数 = 除数 * 商 + 余数
    
    8 ÷ 3 = 2 ... 2
    8 ÷ -3 = -3 ... -1
    
    （7）幂乘 **
    
"""
a = 5
b = +a #这里的+表示正号
print(a)
print(b)

print(+6) #正号只需要跟1个数字
print(5+6) #求和需要2个操作数

x = 8
y = 3
print("加法：", x + y)
print("减法：", x - y)
print("乘法：", x * y)
print("除法：", x / y)
print("整除：", x // y) #向下取整
print("取模：", x % y)
print("幂乘：", x ** y)

m = 8
n = -3
print("除法：", m / n)
print("整除：", m // n)
print("取模：", m % n)

from math import sqrt
print(2 ** 0.5)
print(sqrt(2))