"""
    @Author:Irene
    @Time:2026/5/13
    @Desc:
 """
"""
    所有内容在计算机底层都是二进制。
    
    1、什么是符号位？字节宽度（8的倍数）的最左边的位，称为最高位是符号位
    1个字节：xyyyyyyy  x是符号位
    2个字节：xyyyyyyy yyyyyyyy x是符号位
    正：0  负：1
    +25：00011001
    -25：10011001
    
    2、计算机中的存储单位
    （1）最小单位：比特bit，二进制位，一个比特只能有0或1两种取值
    （2）最基本的单位：字节byte，一个字节=8位
    
    3、符号位还要参与计算
    +25 + -25 = 0
    
         00011001
    +    10011001
    -------------
         10110010  =》 ？？？不对
         
    为了让符号位也参与计算，符合数学的计算规则，提出了原码、反码、补码的概念。
    
    4、原码、反码、补码（理解）
    正数：原码、反码、补码三码合一，不区分
    负数：原码、反码、补码三码不同
        原码：最高位是1，其余位是其绝对值的原码    10011001
        反码：基于原码符号位不变，其余位取反       11100110
        补码：基于反码，+1                     11100111
    计算机和计算器都是基于补码存储和计算的。
    
    +25 + -25 = 0
    
         00011001
    +    11100111
    -------------
        100000000（如果此时只取1个字节，那么就会截断）得到00000000
        
    举例：
        15 + -25 = ？
        00001111
    +   11100111
    -------------
         11110110  =?
    如何看结果的十进制值？
    （1）计算器，  把补码的结果直接粘到计算器中  -10
    （2）人工算 ， 权值相加法，需要用原码  
            补码：11110110
            反码：11110101
            原码：10001010
            
    5、1个字节宽度，表示整数的范围是多少？
            补码
    正数：
        0000 0001           1
        ....
        0111 1111          127
    负数：
        1000 0001           -127
        ...
        1111 1111           -1
    零：
        0000 0000            0
        1000 0000            -0 没有意义。用它表示-128
        
    结论：[-128, 127]
    
    为什么1000 0000是-128？
    因为需要符合计算规则，-127 -1 
         1000 0001           -127
         0000 0001           1
      - =======================
         1000 0000          （-128的补码，单独记）
"""