"""
    @Author:Irene
    @Time:2026/5/16
    @Desc:
"""
"""
一、分类
    1、有序和无序
    有序：列表list，字符串str，元组tuple等
    无序：集合set，dict字典等
    有序：可以通过索引操作元素
    
    2、是否可重复
    可重复：列表list，字符串str，元组tuple等
    不可重复：集合set，dict字典等
    
    3、是否可变
    可变：列表list，集合set，dict字典等
    不可变：字符串str，元组tuple等
    
二、序列的常用基础操作
序列：有序，以字符串、列表为例
list_demo=[1,2,3,4]  , str_demo="hello"
        h   e   l   l  o
    正向 0   1   2   3  4
    负向 -5  -4  -3 -2  -1
1、根据索引/下标访问1个元素：  列表[索引] 或 字符串[索引]
2、根据访问切片多个元素：      列表[start:end:step] 或 字符串[start:end:step]
    step为正，从左往右
    step为负，从右往左
    start和end可以使用正下标体系，也可以使用负下标体系
3、查询某个元素的下标/索引： 列表.index(元素)  或  字符串.index(元素)  元素必须存在，否则报错
4、统计分析 
查找元素的最大值：max(列表)、max(字符串) 
查找元素的最小值：min(列表)、min(字符串)
查找元素的总和：sum(列表)                 序列的元素必须是数值类型
查找某个元素重复几次：列表.count(目标元素)、字符串.count(目标表示)
获取元素的总个数：len(列表)、len(字符串)
5、判断某个元素在不在序列中：元素 in 序列    （序列：列表、字符串等）
6、遍历
(1)for 元素 in 序列:
      语句
(2)for 下标 in range(start,end,step):
        语句
  range(start,end,step)：产生的是一个等差数列。
    step为正：递增数列
    step为负：递减数列
    start,end可以使用正下标体系，也可以使用负下标体系
(3)for 下标,元素 in enumerate(序列):
    语句

三、容器的通用操作
查找元素的最大值：max(容器)
查找元素的最小值：min(容器)
查找元素的总和：sum(容器) 元素必须是数值类型
获取元素的总个数：len(容器)
判断某个元素在不在序列中：元素 in 容器
遍历：for 元素 in 序列:
      语句
"""


