"""
    @Author:Irene
    @Time:2026/5/20
    @Desc:
"""
"""
    二、类的成员之二：方法
    1、在python中类的方法分为3种：
    （1）实例方法
    有没有固定参数：有，第一个参数必须是self，其余参数可以是0~n
    有没有固定的装饰器要求：没有
    在类外面如何访问实例方法：只能通过 对象.实例方法()
    在实例方法中，可以本类的类属性（类名.类属性），实例属性（self.实例属性）都可以。
    
    （2）类方法
    有没有固定参数：有，第一个参数必须是cls，cls代表class类，其余参数可以是0~n
    有没有固定的装饰器要求：有，必须在类方法上加 @classmethod（关于装饰器的具体概念和用法在第12章）
    在类外面如何访问类方法：建议使用 类名.类方法()
    在类方法中只会访问本类的类属性，或调用本类的其他类方法等，不会直接使用本类实例属性。
    
    （3）静态方法
    有没有固定参数：没有
    有没有固定的装饰器要求：有，必须在静态方法上加 @staticmethod
    在类外面如何访问静态方法：建议使用 类名.静态方法()
    在静态方法中，一般不会访问本类的类属性，更不能访问本类的实例属性，通常是一个独立的功能。
    
    2、类方法与静态方法的区分？
    类方法中一般会访问类属性，
    静态方法中一般不会访问类属性，它似乎与本类都没啥关系。
    
"""
class Person:
    home = "地球"

    def __init__(self, name):
        self.name = name

    def eat(self): #实例方法
        print(f"{self.name}在吃饭，我现在{Person.home}")

    @classmethod
    def show(cls): #类方法
        print(f"我是一个人，我住在{cls.home}") #cls等价于Person

    @staticmethod
    def func(): #静态方法
        print(f"我就是一个普通的方法，{Person.home}")#可以访问类属性，但是一般不会这么干


Person.show()
Person.func()
p1 = Person("张三")
p2 = Person("李四")
p1.eat()
p2.eat()