"""
    @Author:Irene
    @Time:2026/5/15
    @Desc:
"""
"""
题目3：从键盘输入男生、女生人数，求占比
效果如下：

    男生：24人，占总人数的51.06%
    女生：23人，占总人数的48.93%
"""
# boy = int(input("请输入男生的人数："))
# girl = int(input("请输入女生的人数："))
# total = boy + girl
# # print(f"男生：{boy}人，占总人数的{round(boy/total*100,2)}%")
# # print(f"男生：{girl}人，占总人数的{round(girl/total*100,2)}%")
#
# print(f"男生：{boy}人，占总人数的{boy/total:.2%}")
# print(f"男生：{girl}人，占总人数的{girl/total:.2%}")

"""
题目5：（算法题，有点难）
如何用最快的方式，计算2与自然数n的最小公倍数
    2与n的最小公倍数分2种情况：
    （1）n是偶数，2与n的最小公倍数是n
    （2）n是奇数，2与n的最小公倍数是2*n
"""
# 写法一：
n = int(input("请输入自然数n的值："))
# print(f"2与{n}的最小公倍数：{ n if n%2==0 else 2*n}")
"""
    n & 1
    n：xxxx xxxy
    1：0000 0001
&-----------------
      0000 0000   y=0    说明n是偶数    n<<0 等价于 n
      0000 0001   y=1    说明n是奇数    n<<1 等价于 n*2
"""
print(f"2与{n}的最小公倍数：{n << (n & 1)}")
