"""
    @Author:Irene
    @Time:2026/5/22
    @Desc:
"""
"""
    1、try-except的语法结构
    try:
        可能发生异常的业务代码①
        可能发生异常的业务代码②
        可能发生异常的业务代码③
    except 异常或错误类型1:
        处理异常或错误的代码
        或
        打印异常或错误的代码（打印到控制台，输出到日志文件中）
    except 异常或错误类型2 as 变量: #该变量用于接收异常对象
        处理异常或错误的代码
        或
        打印异常或错误的代码（打印到控制台，输出到日志文件中）
    except: #可以匹配所有类型的异常或错误
        处理异常或错误的代码
        或
        打印异常或错误的代码（打印到控制台，输出到日志文件中）
        
    执行的过程：
    （1）如果try中没有发生异常，那么所有的except分支都不执行
    （2）如果try中代码②发生异常，那么try中代码③不会执行了。
        此时会在代码②位置根据发生错误的原因，创建对应错误和异常类型的对象，并且抛出。
        抛出之后会去找可以匹配该对象类型的except分支，进入对应的except分支执行。
    （3）如果try中代码发生异常，但是所有的“except 类型:"分支都无法匹配，也没有单独的"except:"分支，
        那么当前方法依然会挂掉（如果代码没有写在方法中，那么当前程序就挂了）。
"""
import traceback
#从控制台输入2个整数，然后求它们的商
a_str = input("请输入被除数的整数：")
b_str = input("请输入除数的整数：")

try:
    a = int(a_str)
    b = int(b_str)
    result = a / b
    print(f"{a} / {b} = {result}")
except ValueError as e:
    # print("被除数或除数不是整数")
    traceback.print_exc() #详细版打印异常或错误，包括堆栈跟踪信息，异常的类型，异常的描述信息，使用日志记录
    # print(e) #e是对象，打印对象会自动调用对象.__str__()
# except ZeroDivisionError:
#     print("除数为0")
# except:
#     print("其他错误")

print("其他代码")