"""
    @Author:Irene
    @Time:2026/5/27
    @Desc:
"""
"""
    1、进程和线程
    程序（Program）：为了完成某个任务/某个功能，选择一种编程语言（例如：python，Java,C/C++等）编写的代码，最终编译或解释为机器指令的集合，就构成了一个程序。
                程序如果不启动，那么它只占用硬盘资源，不占用内存、CPU、网络等资源。没有运行的程序是静态的，不具有动态的资源等。
    软件（Software）：软件 = 程序 + 程序运行所依赖的一些文件、图片等资源。
    进程（Process）：是程序启动后，操作系统会给这个程序分配一块独立的内存，便于管理该程序运行期间的数据、资源等每一个程序的每一次独立运行都有独立的一个进程，
                    操作系统还会给每一个进程分配一个唯一的IP，称为PID。
                    进程是操作系统分配资源的最小单位。
    线程（Thread）：是进程中的其中一条执行路径。一个线程可以完成一个任务。
                如果一个进程中只有一条执行路径，那么该程序称为单线程程序。
                如果一个进程中同时有多条执行路径，那么该程序称为多线程程序。
                线程是CPU调度的最小单位。
    
    2、串行、并行、并发
    串行：多个任务是依次按顺序完成。
        任务1 -> 任务2 -> 任务3    
    并行：多个任务在多个CPU的核中同时进行
        任务1 ->
        任务2 ->
        任务3 ->
    并发：多个任务“同时”进行（占大多数）
        任务1->任务2->任务3   -> 任务1->任务2->任务3   ->  任务1->任务2->任务3 
        |---------------|
          人能感知的时间单位
        CPU在一定时间内快速的在多个线程之间切换，让人感觉是同时进行的，但从微观角度来说是轮询。
        
    3、同步和异步
    同步：一个任务在执行时，另一个任务只能等待。像是串行的效果。
    异步：一个任务在执行时，其他任务也可以同时执行，互相不影响。才是并行或并发的效果。
        
"""
